# Схема Горнера
Ссылка на задачу из курса: [здесь](https://www.coursera.org/learn/python-osnovy-programmirovaniya/programming/X8uac/skhiema-gorniera)  
Сложная задача из курса "Основы программирования на Phyton". Пришлось пересмотреть учебники по алгебре и видео на ютубе, чтобы решить, поэтому хочу залить сюда, чтобы решение не потерялось.   

**Тренировочное задание по программированию: Схема Горнера**  
Дан многочлен P(x) = a[n] xⁿ+a[n-1] xⁿ⁻¹+...+a[1] x+a[0] и число x. Вычислите значение этого многочлена, воспользовавшись схемой Горнера:  
P(x) = ( ... ( ( ( a[n] x + a[n-1] ) x + a[n-2] ) x + a[n-3] ) ... ) x + a[0]
  
**Формат ввода**  
Сначала программе подается на вход целое неотрицательное число n ≤ 20, затем действительное число x, затем следует n+1 вещественных чисел — коэффициенты многочлена от старшего к младшему.
  
**Формат вывода**  
Программа должна вывести значение многочлена.
  
**Примечания** 
При решении этой задачи нельзя использовать массивы и операцию возведения в степень. Программа должна иметь сложность O(n), то есть при увеличении количества входных данных в k раз время выполнения программы должно вырастать примерно в k раз.


**Примеры:**  
```Тест 1
Входные данные:
1
0.000
1.000
1.000

Вывод программы:
1

Тест 2
Входные данные:
2
0.500
1.000
1.000
1.000

Вывод программы:
1.75

Тест 3
Входные данные:
5
7.100
1.000
2.000
3.000
4.000
5.000
6.000

Вывод программы:
24441.5
```

**Мой комментарий к задаче**  
Ссылка на комментарий [здесь](https://www.coursera.org/learn/python-osnovy-programmirovaniya/discussions/all/threads/r14s2-jWEeivog5utGlu8g?utm_medium=email&utm_source=other&utm_campaign=opencourse.discourse.python-osnovy-programmirovaniya~opencourse.discourse.o4mFTLyQEea5qAp8aGSsAg.r14s2-jWEeivog5utGlu8g~i5LkENSUQ-KS5BDUlKPisQ)  
Всем привет. Судя по количеству обсуждений, эта задача либо очень простая и людям просто нечего обсуждать, либо сложная и многие за неё просто не берутся и не обсуждают. Только что закончились мои приключения с решением этой задачи. Сначала я никак не мог понять условия и что от меня вообще хотят. Для этого пришлось разобраться, что такое Схема Горнера. Чтобы понять схему Горнера, надо было выучить теорему Безу. Чтобы выучить теорему Безу, надо было понять, что означает P(x) = (x – x<sub>1</sub>) * Q(x). Чтобы понять, как найти Q(x), надо было научиться делить многочлен уголком. Вдогонку, чтобы всё это закрепить и проверить, надо было вспомнить со школы теорему Виета. Итак, когда я научился решать уравнения высших степеней (звучит пафосно, но на самом деле всё просто), я вернулся к задаче... и понял, что со схемой Горнера задача имеет мало общего, а только внешне похожа на неё. Если кто-то, в отличие от меня, соображает в алгебре, поправьте меня пожалуйста, если я не прав.  
  
Многочлен, значение которого надо вычислить, выглядит примерно так: a<sub>3</sub>x<sup>3</sup> + a<sub>2</sub>x<sup>2</sup> + a<sub>1</sub>x + a<sub>0</sub> = результат, который надо вывести.  
  
Т.е. сначала вы вводите число n. В моём примере выше n = 3 (в тестах n будет любым). Далее один раз вводится число (x) и оно остаётся неизменным, меняется только его степень. Если n = 3, то степеней у (x) тоже будет три: xn, xn - 1 , xn - 2. В частности, в моём примере это степени x<sup>3</sup>, x<sup>2</sup>, x. При этом "При решении этой задачи нельзя использовать массивы и операцию возведения в степень" - вот это надо учитывать. В степень можно возводить циклом.  
  
Далее вводятся коэффициенты (а). В отличие от n и (x), коэффициенты (a) каждый раз вводятся вручную. Количество коэффициентов должно быть n + 1. В моём примере n = 3, поэтому количество коэффициентов (a) = 4. Четвёртый коэффициент - это a0, так называемый свободный член многочлена, потому что он не умножается на (x). Речь идёт именно о количестве коэффициентов, а не об их значении. Значение коэффициентов вы вводите каждый раз вручную. Программа должна сама понимать, когда надо прекратить ввод коэффициентов.  
  
В тесте 2 (пример на странице с задачей) n = 2, x = 0.5, a<sub>2</sub> = 1, a<sub>1</sub> = 1, a<sub>0</sub> = 1. Соответственно: a<sub>2</sub>x<sup>2</sup> + a<sub>1</sub>x + a<sub>0</sub> = 1 ∙ 0.52 + 1 ∙ 0.5 + 1 = 1.75  
  
**Моё решение**  
```python
n = int(input())
x = float(input())
sqX = x  # здесь будет храниться степень x
a = float(input())
i = 2  # потому что нет смысла в x^1 = x
Px = 0
while n > 0:
    # возведение x в нужную степень [n] и [n - 1]
    while i <= n:
        sqX *= x
        i += 1
    print(sqX)
    Px += a * sqX
    n -= 1  # это [n - 1]
    i = 2  # счётчик степени сбрасывается
    sqX = x
    a = float(input())
print(Px + a)
```
